Examples/RegionSolvers/cavityWithHeater/constant/rightHeater/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TFix {
    type scalarSwakSetValue;
    active true;
    selectionMode all;
    useMaskExpression yes;
    maskExpression "mag(pos()-vector(0.15,0.05+0.05*sin(time()/20),0.005)) < 0.01";
    expressions {
        T "time()<20 ? 300-time() : 280" [0 0 0 1 0 0 0];
    }
    scalarSwakSetValueCoeffs {
        selectionMode $..selectionMode;
        useMaskExpression yes;
        maskExpression "mag(pos()-vector(0.15,0.05+0.05*sin(time()/20),0.005)) < 0.01";
        expressions {
            T "time()<20 ? 300-time() : 280" [0 0 0 1 0 0 0];
        }
    }
}

//************************************************************************* //
