Examples/RegionSolvers/cavityWithHeater/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    // fixedWallLeft
    cavity_to_leftHeater
    {
        type mappedWall;
        faces
        (
            (0 4 7 3)
        );
        sampleMode      nearestPatchFace;
        sampleRegion    leftHeater;
        samplePatch     leftHeater_to_cavity;
    }
    cavity_to_rightHeater
    {
        type mappedWall;
        faces
        (
            (2 6 5 1)
        );
        sampleMode      nearestPatchFace;
        sampleRegion    rightHeater;
        samplePatch     rightHeater_to_cavity;
    }
    cavity_to_bottomHeater
    {
        type mappedWall;
        faces
        (
            (1 5 4 0)
        );
        sampleMode      nearestPatchFace;
        sampleRegion    bottomHeater;
        samplePatch     bottomHeater_to_cavity;
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
